<?php

return [
    'home' => [
        'about' => 'Візуалізуйте та контролюйте ключові компоненти міської інфраструктури в режимі реального часу. Наша платформа надає централізований інтерфейс на основі карти для гостей, операторів та адміністраторів.',
        'map_title' => 'Інтерактивна карта інфраструктури',
        'heatmap' => 'Теплова карта',
        'login' => 'Увійти',
        'logout' => 'Вийти',
        'register' => 'Зареєструватись',
    ],
    'register' => [
        'title' => 'Створити акаунт',
        'subtitle' => 'Зареєструйтесь, щоб отримати доступ до свого акаунту.',
        'first_name' => "Ім'я",
        'last_name' => 'Прізвище',
        'email_address' => 'Електронна пошта',
        'city' => 'Місто',
        'city_placeholder' => 'Почніть вводити...',
        'password' => 'Пароль',
        'password_confirmation' => 'Підтвердьте пароль',
        'register' => 'Зареєструватися',
        'already_have_account' => 'Вже маєте акаунт? Увійти'
    ],
    'login' => [
        'title' => 'Ласкаво просимо назад!',
        'subtitle' => 'Увійдіть, щоб отримати доступ до свого акаунту.',
        'email_address' => 'Електронна пошта',
        'password' => 'Пароль',
        'login' => 'Увійти',
        'forgot_password' => 'Не можете увійти?',
    ],
    'forget_password' => [
        'title' => 'Забули пароль?',
        'subtitle' => 'Введіть свою електронну пошту, щоб отримати посилання для скидання пароля.',
        'email_address' => 'Електронна пошта',
        'send_link' => 'Надіслати посилання для скидання',
        'back' => 'Назад до входу',
    ],
    'reset_password' => [
        'title' => 'Скидання пароля',
        'email_address' => 'Електронна пошта',
        'new_password' => 'Новий пароль',
        'password_confirmation' => 'Підтвердьте пароль',
        'reset' => 'Скинути пароль',
    ],
];